Repository: MichalTichy/aGrader
Catalog: CAC/Properties/Resources.*.resx
Languages: cs_cz

source: Nothing to repeat.
cs_cz: Není co opakovat.

# NoValidFilesFound
source: No valid files were found.
cs_cz: Nebyly nalezeny žádné platné soubory.

# DirectoryDoesNotExist
source: The directory does not exist.
cs_cz: Adresář neexistuje!

# MainForm_YouHaveToSelectDirectoryWithSourceCodes
source: You have to select a directory with source codes first.
cs_cz: Nejdříve musíte zvolit adresář obsahující zdrojové kódy.

# CannotCompile
source: Cannot compile the source code.
cs_cz: Kód nemůže být zkompilován!

# MainForm_CannotOpenFile
source: The file was not opened. List of files will be refreshed now.
cs_cz: Soubor se nepovedlo otevřít. Seznam souborů bude nyní aktualizován.

# MainForm_CantUseRequestedGeneratedNumbers
source: Requested generated numbers no longer cannot be used.
cs_cz: Požadovaná náhodná čísla nelze nadále použít!

# MainForm_NothingToExport
source: Nothing to export. You have to add some Input/Output to the protocol first.
cs_cz: Není co exportovat. Nejprve musíte přidat alespoň jeden vstup/výstup.

# MainForm_InputsAndOutputsWillBeOverwriten
source: Existing inputs/outputs will be overwriten.
cs_cz: Budou přepsány stávající vstupy/výstupy!

source: Warning
cs_cz: Upozornění

# FileFilter_XML
source: XML files (*.xml)|*.xml
cs_cz: XML soubory (*.xml)|*.xml

# MainForm_NoSourceCodesInSelectedDirectory
source: There are no source codes in the selected directory!
cs_cz: Ve zvolené složce nejsou žádné zdrojové kódy!

# MainForm_YouNeedToCreateTestProtocolFirst
source: You have to create test protocol first.
cs_cz: Musíte nejdříve vytvořit testovací protokol!

source: Errors
cs_cz: Errory

source: Expected output
cs_cz: Očekávaný výstup

source: Input
cs_cz: Vstup

source: Input/Output
cs_cz: Vstup/Výstup

# MainForm_AllTestsWereFinnished
source: All tests were finished.
cs_cz: Všechny testy byli dokončeny!

# MainForm_FileWasSuccessfulyTested
source: File {0} was tested successully!
cs_cz: Soubor {0} byl úspěšně otestován!

# MainForm_NumberOfFiles
source: Number of files: {0}
cs_cz: Počet souborů: {0}

# MainForm_StartingTests
source: Starting tests!
cs_cz: Zahajuji testy!

# MainForm_TestResultLine
source: Correct: {0} | Incorrect: {1} | Time: {2}| {3}
cs_cz: Správně: {0} | Špatně: {1} | Čas: {2}| {3}

# NameOfFile
source: File name
cs_cz: Jméno souboru

source: Output
cs_cz: Výstup

source: Status
cs_cz: Stav

source: test in progress
cs_cz: testuje se

# FileFilter_TXT
source: text file (*.txt) | *.txt
cs_cz: textový soubor (*.txt) | *.txt

# CouldNotLoadFile
source: An error occurred while loading file {0}.
cs_cz: Soubor {0} se nepodařilo načíst.

# MainForm_CouldNotCreateTextFile
source: An error occurred while creating a file {0}.
cs_cz: Soubor {0} se nepodařilo vytvořit.

# LanguageSelection_ChoseCFiles
source: Select directory that contains files with "*.c" extension.
cs_cz: Zvolte složku která obsahuje soubory s příponou .c

# LanguageSelection_ChooseFolderSingleJava
source: Select directory that contains individual files with "*.java" extension (one file = one test)
cs_cz: Zvolte složku která obsahuje jednotlivé soubory s příponou "*.java" (jeden soubor jeden test)

# LanguageSelection_ChooseFolderJavaMultiFiles
source: Select directory that contains directories which contains "*.java" files (one directory = one test)
cs_cz: Zvolte složku která obsahuje složky které obsahují soubory s příponou "*.java" (jedna složka jeden test)

# FileDoesNotExist
source: File {0} does not exist.
cs_cz: Soubor {0} neexistuje.

# Test_AppDidNotEndedBeforeTimeout
source: The application was not terminated before timeout ({0}s)\n
cs_cz: Aplikace nebyla ukončena před timeoutem ({0}s)\n

# Test_CompilatorNotFound
source: Compilator was not found! \n {0}
cs_cz: Kompilátor nebyl nalezen! \n {0}

# Test_JavaNotFound
source: Java was not found!\n{0}
cs_cz: Java nebyla nalezena!\n{0}

# Test_RequiedCommandWasNotFound
source: Required command was not found: {0}
cs_cz: Nenalezen vyžadovaný příkaz: {0}

# TestManager_UnsuportedTypeOfSourceCode
source: Unsupported type of source file!
cs_cz: Nepodporovaný typ zdrojového souboru!

# TestResult_CannotConvertNumber
source: "{0}" could not be converted to number.
cs_cz: "{0}" nelze převést na číslo.

# XmlManager_UnsuportedXmlFile
source: Selected XML file is not supported.
cs_cz: Zvolený XML soubor není podporován.

# XmlManager_InvalidDataImportFail
source: {0} is not supported and was not imported.
cs_cz: {0} není podporován a nebyl importován.

# XmlManager_ImportFailed
source: An error occured during import.
cs_cz: Během importu se vyskytla chyba!

# IOFDescription_CompareFiles
source: ACTION: comparison of file {0} and generated file
cs_cz: AKCE: porovnání souboru {0} a vygenerovaného souboru

source: Delete
cs_cz: Smazat

# YouHaveToSelectFile
source: You have to select some file!
cs_cz: Musíte vybrat soubor!

# IOFDescription_LoadOutputsFromFile
source: ACTION: Load outputs from file
cs_cz: AKCE: Načti výstupy ze souboru

# ActionRepeatLast_NothingToRepeat
source: Nothing to repeat.
cs_cz: Není co opakovat.

# ActionRepeatLast_LastActionCouldNotBeRepeated
source: Last action could not be repeated.
cs_cz: Poslední akce nemůže být zopakována.

# IOFDescription_InputNumber
source: INPUT: number {0}
cs_cz: VSTUP: číslo {0}

# IOFDescription_RepeatLast
source: ACTION: repeat last step {0}x
cs_cz: AKCE: opakuj předešlý krok {0}x

# InputRandomNumber_MaxCantBeGreatherThanMin
source: MAX can't be greater than Min
cs_cz: MAX nemůže být menší než MIN!

# InputRandomNumber_MinCantBeGreatherThanMax
source: MIN can't be greater than Max
cs_cz: MIN nemůže být větší než MAX!

# IOFDescription_InputRandomDecimalNumber
source: INPUT: random decimal number from {0} to {1}
cs_cz: VSTUP: náhodné desetinné číslo od {0} do {1}

# IOFDescription_InputRandomNumber
source: INPUT: random number from {0} to {1}
cs_cz: VSTUP: náhodné celé číslo od {0} do {1}

# IOFDescription_InputString
source: INPUT: text: \"{0}\"
cs_cz: VSTUP: text: \"{0}\"

# IOFDescription_InputTextFile
source: INPUT: file {0}
cs_cz: VSTUP: soubor {0}

# IOFDesruption_CountOfNumMatchingMultipleConditions
source: OUTPUT: count of number matching {0} conditions
cs_cz: VÝSTUP: počet čísel splňující {0} podmínek.

# IOFDesruption_CountOfNumMatchingSingleCondition
source: OUTPUT: count of number matching 1 condition
cs_cz: VÝSTUP: počet čísel splňujících 1 podmínku.

# OutputCountOfNumbersMatchingConditions_ThisConditionAllreadyExists
source: This condition already exists.
cs_cz: Tato podmínka již existuje.

# OutputCountOfNumbersMatchingConditions_InvalidCondition
source: The condition is not valid.
cs_cz: Podmínka není validní.

# OutputCountOfNumbersMatchingConditions_YouHaveToSelectConditionForDeletion
source: You have to select condition for deletion first.
cs_cz: Musíte zvolit kterou podmínku chcete vymazat.

# OutputCountOfNumbersMatchingConditions_RequestedNumberOfNumbersIsNotPOssible
source: The requested count of numbers is not possible.
cs_cz: Požadovaný počet čísel není možný.

# IOFDescription_OutputNumber
source: OUTPUT: Number {0}
cs_cz: VÝSTUP: Číslo {0}

# OutputNumberBasedOnRandomInput_InvalidFormatOfMath
source: Math has an incorrect format! If you still wish to continue then the object will be deleted.
cs_cz: Matematický příklad nemá správný formát! Pokud si přejete pokračovat objekt bude smazán.

# OutputNumberBasedOnRandomInput_YouHaveToEnterValidMath
source: You have to enter valid math.
cs_cz: Musíte zadat platný matematický příklad.

# IOFDescription_NumberBasedOnGeneratedInput
source: OUTPUT: Number based on generated values.
cs_cz: VÝSTUP: Číslo závyslé na vygenerovaných hodnotách.

# IOFDescription_NumberSatisfyingMultipleConditions
source: OUTPUT: Number satisfying {0} conditions.
cs_cz: VÝSTUP: číslo splňující {0} podmínek.

# IOFDescription_NumberSatisfyingSingleCondition
source: OUTPUT: Number satisfying 1 condition.
cs_cz: VÝSTUP: číslo splňující 1 podmínku.

# OutputNumberMatchingConditions_ThisConditionAllreadyExists
source: This condition already exists.
cs_cz: Tato podmínka již existuje.

# IOFDescription_OutputString
source: OUTPUT: text: \"{0}\"
cs_cz: VÝSTUP: text: \"{0}\"

# SettingsDeviation_DeviationIsAllreadySet
source: Deviation is already set!
cs_cz: Odchylka je již nastavena!

# IOFDescription_ProhibitedCommand
source: SETTINGS: Prohibited command \"{0}\"
cs_cz: NASTAVENÍ: Zakázaný příkaz {0}

# IOFDescription_RequiedCommand
source: SETTINGS: Requied command \"{0}\"
cs_cz: NASTAVENÍ: Vyžadovaný příkaz {0}

# IOFDescription_SettingsDeviation
source: SETTINGS: Maximal deviation {0}
cs_cz: NASTAVENÍ: Maximální odchylka {0}

# SettingsStartupArguments_StartupArgumentsAreAllreadySet
source: Startup arguments are already set.
cs_cz: Spouštěcí parametry jsou již nastaveny.

# IOFDescription_StartupArguments
source: SETTINGS: Startup arguments: \"{0}\"
cs_cz: NASTAVENÍ: souštěcí parametry: \"{0}\"

# SettingsTimeout_TimeoutAllreadySet
source: Timeout is already set!
cs_cz: Timeout je již nastaven!

source: ACTION: Compare files
cs_cz: AKCE: porovnej soubory

# ActionLoadOutputsFromTextFile
source: ACTION: Load outputs from file
cs_cz: AKCE: načti výstupy ze souboru

# ActionRepeatLast
source: ACTION: Repeat last action
cs_cz: AKCE: opakování poslední akce

source: INPUT: Number
cs_cz: VSTUP: číslo

source: INPUT: Random number
cs_cz: VSTUP: náhodné číslo

# InputString
source: INPUT: Text
cs_cz: VSTUP: text

source: INPUT: Text file
cs_cz: VSTUP: textový soubor

# IOFDescription_SettingsTimeout
source: SETTINGS: Program timeout: {0}
cs_cz: NASTAVENÍ: Maximální doba pro běh programu: {0}

source: OUTPUT: Count of numbers matching conditions
cs_cz: VÝSTUP: počet čísel splňujících podmínky

source: OUTPUT: Number
cs_cz: VÝSTUP: číslo

# OutputNumberBasedOnRandomInput
source: OUTPUT: Number based on generated number
cs_cz: VÝSTUP: číslo založené na vygenerovaném číslu

source: OUTPUT: Number matching conditions
cs_cz: VÝSTUP: číslo splňující podmínky

# OutputString
source: OUTPUT: Text
cs_cz: VÝSTUP: text

source: SETTINGS: Deviation
cs_cz: NASTAVENÍ: odchylka

source: SETTINGS: Prohibited command
cs_cz: NASTAVENÍ: zakázaný příkaz

# SettingsRequiedCommand
source: SETTINGS: Required command
cs_cz: NASTAVENÍ: vyžadovaný příkaz

source: SETTINGS: Startup arguments
cs_cz: NASTAVENÍ: Spouštěcí parametry

# SettingsTimeout
source: SETTINGS: Program timeout
cs_cz: NASTAVENÍ: maximální čas pro běh programu

# Test_ProhibitedCommandFound
source: Prohibited command found: {0}
cs_cz: Nalezen nepovolený příkaz: {0}

# Validator_UnknownVariable
source: Math contains the unknown variable.
cs_cz: Matematický příklad obsahuje neexistující neznámou.

# SourceCodeJava_MultipleFilesWithMainFound
source: Multiple files with main method found!
cs_cz: Nalezeno několik souborů s metodou Main!

# SourceCodeJava_NoFileWithMainFound
source: No file with main method found!
cs_cz: Nenalezen soubor s metodou Main!

# YouDontHavePermisionsToReadFile
source: You don't have permission to read {0}!
cs_cz: Na čtení {0} nemáte oprávnění!

# SourceCodes_UnsuportedFileExtension
source: Unsupported type of file.
cs_cz: Nopodporovaný typ souboru.

# SourceCodes_JavaSingleMultiMismatch
source: Directory contains programs made from single java file and programs with multiple java files simultaneously. You have to choose only one of those.
cs_cz: Složka obsahuje samostatné soubory i skupiny souborů. Buď odstraňte složky se skupinami souborů nebo samostatné soubory.

# XmlManager_ExportFailed
source: Export failed!
cs_cz: Protokol se nepodařilo exportovat.

# XmlManager_ExportWasSuccesful
source: Export was succesful.
cs_cz: Protokol byl úspěšně vyexportován.

# Test_CompilatorNotFoundWannaDownload
source: Compile (TCC) was not found. Do you want to download it?
cs_cz: Kompilátor (TCC) nebyl nelezen. Chcete ho stáhnout?

# TestC_DownloadFailed
source: Download failed!
cs_cz: Stahování selhalo!

source: Tests cannot be run without compiler!
cs_cz: Bez kompilátoru nelze testy spustit!

# JdknotFound
source: Java Development Kit not found!
cs_cz: Java Development Kit nebyl nalezen!

source: Invalid path!
cs_cz: Nesprávná cesta!

# ActionStartExternalApp_Tip
source: Run before test: @name will be replaced by tested file name. Run after test: @name will be replaced by tested file name. @correct will be replaced by count of right outputs. @wrong will be replaced by count of wrong outputs. @time will be replaced by processor time.
cs_cz: Spustit před testem: @name bude nahrazeno jménem zdrojového souboru. Spustit po testu: @name bude nahrazeno jménem zdrojového souboru. @correct bude nahrazeno počtem zprávných výstupů. @wrong bude nahrazeno počtem nezprávných výstupů. @time bdue nahrazeno časem který bzl nutný pro běh (processor time)

# ActionStartExternalApp_invalidArguments
source: When external application is run before test, than the arguments can't contain "After test run" placeholders (@correct,...)
cs_cz: Pokud je externí aplikace spuštěna před testem, pak spouštěcí argument nesmí obsahovat zástupné symboly pro externí aplikace spouštěné po testu (@correct,...)

# ActionStartExternalApp
source: ACTION: Run external application
cs_cz: AKCE: Spustit externí aplikaci

# IOFDescription_RunExternalApplication
source: ACTION: Run external application
cs_cz: AKCE: Spustit externí aplikaci
